app/controllers/active_sessions_controller.rb

SELECT "active_sessions".* FROM "active_sessions" WHERE "active_sessions"."user_id" = $1 AND "active_sessions"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 6], ["LIMIT", 1]]
DELETE FROM "active_sessions" WHERE "active_sessions"."id" = $1  [["id", 6]]
---
  def destroy
    @active_session = current_user.active_sessions.find(params[:id])
    @active_session.destroy

DELETE FROM "active_sessions" WHERE "active_sessions"."id" = $1  [["id", 2]]
---
  def destroy_all
    current_user.active_sessions.destroy_all