app/controllers/confirmations_controller.rb

    def create
        @user = User.find_by(email: params[:user][:email].downcase)

      if @user.present? && @user.unconfirmed?
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "mdreis@crimson.ua.edu"], ["LIMIT", 1]]