app/controllers/listings_controller.rb

  def index
    if params[:search].present?
  # Join the users table and search for first_name in the users table
      @listings = Listing.joins(:user).where('users.first_name ILIKE ?', "%#{params[:search]}%")
    else
      @listings = Listing.all
---
SELECT "listings".* FROM "listings" WHERE "listings"."user_id" = $1 AND "listings"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]

  def create
    @listing = current_user.listings.build(listing_params)
    if @listing.save
---
INSERT INTO "listings" ("title", "status", "category", "size", "brand", "color", "new_with_tags", "style_tags", "sell", "rent", "original_price", "listing_price", "rental_price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"

  def update
    @listing = Listing.find(params[:id])
    @listing.status = "Verified"
    if @listing.save
---
SELECT "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "listings" SET "status" = $1, "updated_at" = $2 WHERE "listings"."id" = $3  [["status", "Verified"], ["updated_at", "2024-03-25 21:28:07.338190"], ["id", 1]]