app/controllers/users_controller.rb

    def create
        @user = User.new(create_user_params)
        if @user.save
---
INSERT INTO "users" ("username", "password_digest", "email", "phone_number", "first_name", "last_name", "confirmed_at", "created_at", "updated_at", "unconfirmed_email", "remember_token") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

    def profile_normal
      @user = current_user
      @listings = @user.listings || []

      @active_sessions = @user.active_sessions.order(created_at: :desc)
---
SELECT "active_sessions".* FROM "active_sessions" WHERE "active_sessions"."user_id" = $1 ORDER BY "active_sessions"."created_at" DESC  [["user_id", 1]]

    def profile_admin
      @user = current_user
      @listings = Listing.all

      @active_sessions = @user.active_sessions.order(created_at: :desc)
---
SELECT "listings".* FROM "listings"
SELECT "active_sessions".* FROM "active_sessions" WHERE "active_sessions"."user_id" = $1 ORDER BY "active_sessions"."created_at" DESC  [["user_id", 1]]

    def update
      @user = current_user
      @active_sessions = @user.active_sessions.order(created_at: :desc)
      if @user.authenticate(params[:user][:current_password])
        if @user.update(update_user_params)
---
UPDATE "users" SET "password_digest" = $1, "unconfirmed_email" = $2 WHERE "users"."id" = $3  [["password_digest", "[FILTERED]"], ["unconfirmed_email", ""], ["id", 2]]