app/controllers/users_controller.rb

    def profile_normal
      @user = current_user
      @listings = @user.listings || []

      if params[:unverified_only] == '1'
        @listings = @listings.where(status: 'Unverified')
      end

      if params[:sort_by].present?
        sort_column, sort_direction = params[:sort_by].split('_')
        sort_column = case sort_column
                      when 'title'
                        'title'
                      when 'listingprice'
                        'listing_price'
                      when 'createdat'
                        'created_at'
                      else
                        'created_at'
                      end

        sort_direction = sort_direction == 'asc' ? 'asc' : 'desc'

        @listings = @listings.order("#{sort_column} #{sort_direction}")
---
SELECT "listings".* FROM "listings" WHERE "listings"."user_id" = $1  [["user_id", 1]]