app/models/user.rb

  def reconfirming?
    unconfirmed_email.present?
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "acsullivan6@crimson.ua.edu"], ["LIMIT", 1]]