app/controllers/concerns/authentication.rb

    def login(user)
      reset_session
      active_session = user.active_sessions.create!(user_agent: request.user_agent, ip_address: request.ip)
---
INSERT INTO "active_sessions" ("user_id", "created_at", "updated_at", "user_agent", "ip_address", "remember_token") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def logout
      active_session = ActiveSession.find_by(id: session[:current_active_session_id])
      reset_session
      active_session.destroy! if active_session.present?
---
SELECT "active_sessions".* FROM "active_sessions" WHERE "active_sessions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "active_sessions" WHERE "active_sessions"."id" = $1  [["id", 1]]

    def current_user
      Current.user = if session[:current_active_session_id].present?
        ActiveSession.find_by(id: session[:current_active_session_id])&.user
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "active_sessions".* FROM "active_sessions" WHERE "active_sessions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]